"""Як бачите, ми присвоюємо відображення із назвою post_list значенню URL ^$.
Цей регулярний вираз буде перевіряти рядок
на ^ (початок рядка) та $ (кінець) - тому тільки порожній рядок буде відповідати цим вимогам.
Це правильно, тому що в механізмі Django URL, вираз ' http://127.0.0.1:8000 /' не є частиною URL-адреси.
Цей шаблон показуватиме для Django, що views.post_list є правильним місцем для переходу,
якщо хтось введе ваш сайт за адресою 'http://127.0.0.1:8000/'.
На останок, name='post_list' - це назва URL, який використовуватиметься для ідентифікації
потрібного відображення (в'ю). Це може бути ім'ям потрібного нам відображення (в'ю),
або взагалі чимось іншим. Ми буде використовувати іменовані URL-адреси,
протягом всього проекту, тому важливо, давати ім'я кожному URL у застосунку.
Ми також повинні намагатися давати URL-адресам якомога простіші та унікальні імена,
і так, щоб їх було легко запам'ятати.

"""



from django.conf.urls import url
from . import views

urlpatterns = [
    url(r'^$', views.post_list, name='post_list'),
]
